---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorLapSpliceFailure
source: html/83b1ca77-652a-580e-9461-004603675986.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorLapSpliceFailure Property

The lap splice in the major direction is greater than the half of the overall length.

## Syntax (C#)
```csharp
public static FailureDefinitionId MajorLapSpliceFailure { get; }
```